Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: command-line client and the log4j-yarn-session.properties file used by the command- line client when starting a YARN session.
zh_cn: 为启用YARN会话的命令行客户端提供了log4j-yarn-session.properties文件。

source: commit(txn: TXN): Unit commits a transaction.
zh_cn: commit(txn: TXN): Unit提交指定事务。

source: communicate only through well-defined channels.
zh_cn: 此外，容器之间处于相互隔离的状态，它们只会通过明确定义的通道进行通信。

source: community@flink.apache.org : community news and meetups
zh_cn: community@flink.apache.org：社区新闻和聚会

source: compared to event time as it does not provide deterministic results and has simi‐ lar performance as event time.
zh_cn: 和事件时间相比，摄入时间（ingestion time）的价值不大，因为它的性能和事件时间类似，但却无法提供确定的结果。

source: configure an inactivity interval after which a part file is rolled.
zh_cn: 此外，你还可以配置一个非活动间隔（inactivity interval），并在该间隔过后滚动生成新的分块文件。

source: connection pattern of the rescale distribution transformation is shown in Figure 5-7.
zh_cn: 图5-7展示了重调分发转换的连接模式。

source: console dashboard that queries the queryable state of the application shown in the previous section.
zh_cn: 示例7-16展示了一个简单的控制台仪表盘，它会对上一节中应用的可查询式状态进行查询。

source: constantly produced output using the tail command as follows:
zh_cn: 可以使用tail命令监控持续产生的结果：

source: course, quite inefficient and should be avoided.
zh_cn: 这会非常耗时，需要在实际应用中避免。

source: curl -X <HTTP-Method> [-d <parameters>] http://hostname:port/v1/<REST-point> The v1 indicates the version of the REST API.
zh_cn: curl -X <HTTP-Method> [-d <parameters>] http://hostname:port/v1/<REST-point> v1表示REST API的版本。

source: currentProcessingTime(): Long returns the current processing time.
zh_cn: currentProcessingTime(): Long返回当前的处理时间。

source: currentWatermark(): Long returns the timestamp of the current watermark.
zh_cn: currentWatermark(): Long返回当前水位线的时间戳。

source: cuss how you can tweak the default behavior and control task chaining and the assignment of tasks to slots to improve the performance of your applications.
zh_cn: 本节我们将讨论如何通过调整默认行为和控制任务链接及作业分配来提高应用的性能。

source: data with other TaskManagers that run tasks of the same application.
zh_cn: 在执行期间，运行同一应用不同任务的TaskManager之间会产生数据交换。

source: default parallelism of their associated StreamExecutionEnvironment.
zh_cn: 默认情况下，算子会以其关联的StreamExecutionEnvironment中的默认并行度来运行。

source: defined by calling setParallelism() on StreamExecutionEnvironment or on an
zh_cn: 换言之，通过StreamExecutionEnvironment或算子的setParallelism()方法定义的并行度比默认值优先级更高。

source: definition files, you can register them to Kubernetes using the kubectl command:
zh_cn: 一旦有了这些定义文件，你就可以使用kubectl命令将它们注册到Kubernetes：

source: deleteEventTimeTimer(timestamp: Long): Unit deletes an event-time timer that was previously registered for the current key.
zh_cn: deleteEventTimeTimer(timestamp: Long): Unit针对当前键值删除一个注册过的事件时间计时器。

source: deleteProcessingTimeTimer(timestamp: Long): Unit deletes a processing- time timer that was previously registered for the current key.
zh_cn: deleteProcessingTimeTimer(timestamp: Long): Unit针对当前键值删除一个注册过的处理时间计时器。

source: deploying Flink applications and the way each distributes and executes tasks.
zh_cn: 我们主要讨论两类部署Flink应用的方式以及它们如何分配和执行任务。

source: dev@flink.apache.org : development, release, and community discussions
zh_cn: dev@flink.apache.org：开发，发布和社区讨论

source: different pieces of state as follows:
zh_cn: 窗口包含的不同状态如下：

source: distribution behavior when the HighTempCounter function is rescaled, we can imple‐ ment the snapshotState() method so that it splits its count into multiple partial counts as shown in Example 7-5.
zh_cn: 为了让状态在HighTempCounter函数扩缩容时分布地更好，我们可以像示例7-5中那样，在实现snapshotState()方法时将计数值分成多个子部分。

source: does not automatically clean up savepoints.
zh_cn: 同时，Flink也不会自动清理保存点。

source: dow does not exist yet, it is created.
zh_cn: 如何目标窗口不存在，则会创建它。

source: effectively executed with a parallelism of 1.
zh_cn: 从而强制算子以并行度1来执行。

source: emitWatermark() emits the provided watermark.
zh_cn: emitWatermark()用来发出传入的水位线。

source: enableWriteAheadLog([CheckpointCommitter]): This enables the WAL to pro‐ vide exactly-once output guarantees in the case of nondeterministic application logic.
zh_cn: enableWriteAheadLog([CheckpointCommitter])：开启WAL，为非确定性的应用逻辑提供精确一次输出保障。

source: enabled by calling setWriteTimestampToKafka(true) on the sink object.
zh_cn: 你可以在数据汇对象上调用setWriteTimestampToKafka(true)方法来将事件时间的时间戳写入Kafka记录。

source: environment offers more configuration options, such as setting the program parallel‐ ism and enabling fault tolerance.
zh_cn: 执行环境还提供了很多配置选项，例如设置程序并行度，启用容错等。

source: event, the operator updates the corresponding aggregate value and emits an event with the updated value.
zh_cn: 每当有新事件到来，该算子都会更新相应的聚合结果，并将其以事件的形式发送出去。

source: events with the same key are processed by the same task of the subsequent operator.
zh_cn: 这样一来有着相同键值的事件一定会在后续算子的同一个任务上处理。

source: example is a stream of rules and a stream of events on which the rules are applied.
zh_cn: 一个典型的例子是有一条规则流和一条需要应用这些规则的事件流。

source: examples are windows with count-based triggers, which process and clean their state when a certain number of records has been received.
zh_cn: 其他例子还有像基于数量触发的窗口，它们只有在收到一定数量的记录时才会进行处理并清除状态。

source: exists, the method has no effect.
zh_cn: 如果该计时器不存在，则方法不会有任何作用。

source: fails if the savepoint folder is neither explicitly specified in the command nor avail‐ able from the configuration.
zh_cn: 如果保存点文件夹既没有在命令中指定，也无法从配置中获取，则命令会执行失败。

source: fashion, i.e., the data input of a query is fully available and the query terminates after it returned the computed result.
zh_cn: 即，可以全量获取查询输入且查询会在返回结果后终止。

source: fetched, the TypeInformation for the key, and the StateDescriptor of the queried state.
zh_cn: 键值的TypeInformation以及可查询式状态的StateDescriptor。

source: field is the common key, the second field is the sum, and the third field is not defined.
zh_cn: 结果中的第一个字段是键值，第二个字段是总和，第三个字段没有定义。

source: first type are periodic report queries that compute business-relevant statistics such as revenue, user growth, or production output.
zh_cn: 第一类是定期报告查询。它可用于计算业务相关的统计数据，如收入、用户增长、产出等。

source: for the Scala API, and it is used as shown in the following:
zh_cn: 它的用法如下：

source: from a window by calling the remove() method on the Iterator that can be obtained from the Iterable.
zh_cn: 从Iterable中可以取得Iterator对象，调用后者的remove()方法就能删除元素。

source: fs.<scheme>.limit.total: (number, 0/-1 mean no limit) fs.<scheme>.limit.input: (number, 0/-1 mean no limit) fs.<scheme>.limit.output: (number, 0/-1 mean no limit) fs.<scheme>.limit.timeout: (milliseconds, 0 means infinite) fs.<scheme>.limit.stream-timeout: (milliseconds, 0 means infinite)
zh_cn: fs.<scheme>.limit.total:（数字，0或-1表示无限制） fs.<scheme>.limit.input:（数字，0或-1表示无限制） fs.<scheme>.limit.output:（数字，0或-1表示无限制） fs.<scheme>.limit.timeout:（毫秒数，0表示无限） fs.<scheme>.limit.stream-timeout:（毫秒数，0表示无限）

source: function is restored, the parts of the state are distributed among all parallel instances of the function and handed to the restoreState() method.
zh_cn: 在函数进行状态恢复时，Flink会将状态的各个部分分发到函数的所有并行实例上，并利用每个实例上的状态调用restoreState()方法。

source: gives access to the element or timer timestamp, a TimerService, and side outputs.
zh_cn: 在被调用时都会传入一个Context对象，用于访问当前元素或计时器时间戳、TimerService及副输出。

source: holds the information used to distinguish windows from each other.
zh_cn: 因此窗口对象中保存着用于区分窗口的信息。

source: host.taskmanager.512” where “localhost” and “512” are parameter values.
zh_cn: 其中"localhost"和"512"是参数值。

source: ices as the Context object of the processElement() method and also returns the time domain (processing time or event time) of the firing trigger.
zh_cn: 此外，它还会返回触发计时器的时间域（处理时间还是事件时间）。

source: identified by an OutputTag[X] object, where X is the type of the resulting side output
zh_cn: 每个副输出都由一个OutputTag[X]对象标识，其中X是副输出结果流的类型。

source: if you changed the ValueState[String] to a ValueState[Double], Flink would cre‐ ate a DoubleSerializer to access the state.
zh_cn: 举例而言，如果你将ValueState[String]改为ValueState[Double]，Flink将创建一个DoubleSerializer来访问状态。

source: if you need to ensure a function’s operator state can be evolved.
zh_cn: 如果想确保函数的算子状态日后支持更新，请使用CheckpointedFunction接口替代ListCheckpointed。

source: ify an offset as a second parameter in the assigner.
zh_cn: 或者你也可以通过第二个参数指定一个偏移量。

source: implement your own streaming sinks.
zh_cn: 你也可以选择自己实现流式数据汇。

source: implications on the robustness of an application.
zh_cn: 但它会影响应用的鲁棒性。

source: in Example 8-15 does not need the context and hence sets the type to Void.
zh_cn: 示例8-15中的TransactionalFileSink不需要该上下文对象，因此将其类型设置为Void。

source: in time, usually the point in time at which the event that is represented by the record happened.
zh_cn: 时间戳将记录和特定时间点进行关联，这些时间点通常是记录所表示事件的发生时间。

source: increase the processing latency of an application.
zh_cn: 但它仍会增加应用处理延迟。

source: increased the parallelism of this operator, some of the new subtasks would be initial‐ ized with an empty state, and start counting from zero.
zh_cn: 如果我们增加算子的并行度，那么部分新的子任务就只能得到空的状态，从而需要从零开始计数。

source: increases the number of buffers but can reduce the efficiency of the network stack.
zh_cn: 降低单个网络缓冲区的大小可以增加其数量，但会降低网络栈整体的工作效率。

source: information between multiple windows on the same key.
zh_cn: 全局状态可用于在键值相同的多个窗口之间共享信息。

source: input split, read the file range that is defined by the split, and return all corresponding
zh_cn: 按照划分中限定的范围读取文件并返回所有相应的记录。

source: instance, ValueState is completely deserialized when it is accessed and serialized when it is updated.
zh_cn: 例如，ValueState需要在更新和访问时分别进行完整的序列化和反序列化。

source: instance, the default scope for TaskManager metrics might create the scope “local‐
zh_cn: 例如，TaskManager指标的默认域可能是"localhost.taskmanager.512"，

source: instance, when you join or group by some key, TypeInformation allows Flink to per‐ form the semantic check of whether the fields used as keys are valid.
zh_cn: 例如：如果需要通过某个键值进行Join或分组，TypeInformation允许Flink对能否使用某字段作为键值进行语义检测。

source: instances of an operator, the proxy needs to identify the TaskManager that main‐ tains the state for the requested key.
zh_cn: 由于键值分区状态会分布在算子所有并行实例上面，所以代理需要识别请求键值对应的状态所在的TaskManager。

source: interval is set to two hundred milliseconds, but it can be configured using the Execu tionConfig.setAutoWatermarkInterval() method:
zh_cn: 默认的时间间隔为200毫秒，但你可以利用ExecutionConfig.setAutoWatermarkInterval()方法对其进行配置：

source: invoke(txn: TXN, value: IN, context: Context[_]): Unit writes a value to the current transaction.
zh_cn: invoke(txn: TXN, value: IN, context: Context[_]): Unit将传入值写入当前事务中。

source: is configured per operator using the setMaxParallelism() method.
zh_cn: 为了设置该键值组的数值，我们可以针对每个算子调用setMaxParallelism()方法。

source: is started or when a task is restarted due to a failure.
zh_cn: 其触发时机是应用启动或由于故障而重启任务。

source: it is modified because its modification timestamp changes.
zh_cn: 这意味着文件如果发生改动（其修改时间发生变化），则会被完全重新处理。

source: iv | Table of Contents
zh_cn: iv | 目录

source: job-cluster-job.yaml.template configures the master container as a Kubernetes job.
zh_cn: job-cluster-job.yaml.template将主容器配置为Kubernetes作业。

source: join is defined as shown in Example 6-18.
zh_cn: 示例6-18中定义了一个基于间隔的Join。

source: learned about Flink’s AsyncFunction, which can significantly improve the perfor‐
zh_cn: 最后，你学习了Flink的AsyncFunction，它可以通过异步处理请求显著提高与外界系统交互的性能。

source: limited JobManager heap storage, it is not recommended for production environ‐ ments.
zh_cn: 所以不建议将其用于生产环境。

source: low latency but results depend on the speed of processing and are not deterministic.
zh_cn: 总而言之，虽然处理时间提供了很低的延迟，但它的结果依赖处理速度，具有不确定性。

source: main() method assembles the dataflow and submits it to a remote JobManager when the StreamExecutionEnvironment.execute() method is called.
zh_cn: 通常情况下程序的main()方法会把Dataflow组装好，然后在StreamExecutionEnvironment.execute()方法被调用时将其提交到远程的JobManager上。

source: maintain information that should be shared between multiple invocations of the pro cess() method on the same window, which can happen due to configuring allowed lateness or using a custom trigger.
zh_cn: 单个窗口状态用于维护同一窗口内多次调用process()方法所需共享的信息，这种多次调用可能是由于配置了允许数据迟到或使用了自定义触发器。

source: manager.512.MyMetrics.myCounter.” You can change the default “.” delimiter by set‐ ting the metrics.scope.delimiter configuration option.
zh_cn: 你可以通过metrics.scope.delimiter配置项对默认分隔符"."进行修改。

source: map1() and flatMap1() are called to process an event of the first input and map2() and flat Map2() are invoked to process an event of the second input:
zh_cn: map1()和flatMap1()用来处理第一条输入流的事件，map2()和flatMap2()用来处理第二条输入流的事件：

source: matically puts all keyed state objects of the function into the context of the key of the record that is passed by the function call.
zh_cn: Flink运行时会在调用它的处理方法时自动将函数中的全部键值分区状态对象放入当前处理记录的键值上下文中。

source: mentations for the different state primitives, such as ValueState, ListState, and
zh_cn: 每一种状态后端都为不同的状态原语（如ValueState、ListState和MapState）提供了不同的实现。

source: method assembles the operator state from possibly multiple parts.
zh_cn: 而restoreState()方法也可以利用（一个或）多个部分对算子状态进行组装。

source: method is to ensure all state objects are updated before the checkpoint is done.
zh_cn: snapshotState()方法的目的是确保检查点开始之前所有状态对象都已更新完毕。

source: method will replace existing values with the given list of values.
zh_cn: 该方法将使用给定列表的值替换已有值。

source: method, Flink assigns default identifiers, which are hash values that
zh_cn: 则Flink会根据算子类型和它所有前置算子计算一个哈希值作为其默认标识。

source: microservices are strictly decoupled from each other and only communicate over well-defined interfaces, each microservice can be implemented with a different tech‐ nology stack including a programming language, libraries, and datastores.
zh_cn: 由于微服务彼此间严格解耦且仅通过定义良好的接口通信，所以在实现微服务时可以选用不同的技术栈，包括编程语言、类库和数据存储等。

source: monly used for cleanup and releasing resources.
zh_cn: 因而它通常用于清理和释放资源。

source: monotonically increasing, you can use the shortcut method assignAscending TimeStamps.
zh_cn: 则可以使用一个简便方法assignAscendingTimeStamps。

source: munication, the blob manager (to exchange large files), the queryable state server, and the Web UI and REST interface.
zh_cn: Blob管理器（用于交换大文件）、可查询式状态服务器以及Web UI（REST接口）的端口。

source: need to update your application because Java serialization does not allow for migrating or configuring a custom serializer.
zh_cn: 由于该序列化机制不支持目标迁移或配置自定义序列化器，所以可能会在你需要更新应用时导致问题。

source: neither the ReduceFunction nor the AggregateFunction are suitable.
zh_cn: 对于此类应用，ReduceFunction和AggregateFunction都不适合。

source: new ValueStateDescriptor[(String, Double)]( "", // state name not relevant here Types.TUPLE[(String, Double)]))
zh_cn: new ValueStateDescriptor[(String, Double)]( "", // 此处和状态名称无关 Types.TUPLE[(String, Double)]))

source: not have access to timestamps or the current event time.
zh_cn: MapFunction无法访问时间戳或当前的事件时间。

source: notification corresponds to the 2PC protocol’s commit command.
zh_cn: 该完成通知相当于2PC协议中的提交指令。

source: of an application that uses the in-memory or filesystem state backend is also stored on the JVM. Note that a single task can potentially consume the whole heap memory of the JVM that it is running on.
zh_cn: 应用中基于内存或文件系统后端的状态同样会存到JVM中。注意，单个任务可能会耗尽其所在JVM的所有内存，

source: of elements in the window (size), the window object, and an EvictorContext that
zh_cn: 窗口内的元素数量、窗口对象以及一个用于访问当前处理时间和水位线的EvictorContext。

source: of state is custom for every stateful function, this cannot be automatically done for arbitrary types of state.
zh_cn: 由于每个函数都有自己的状态拆分及合并逻辑，所以这两个过程无法对任意状态类型都自动完成。

source: of the parallel partitions of a DataStream is skewed, we might want to rebalance the data to evenly distribute the computation load of subsequent operators.
zh_cn: 举例而言，如果我们知道DataStream的并行分区存在倾斜现象，那么可能就希望通过重新平衡数据来均匀分配后续算子的负载。

source: on port 8081, the following curl command submits a GET request to the /overview
zh_cn: 以下curl命令将向/overview的REST端点提交一个GET请求：

source: on some of the operators, you might need to adjust the source code and recompile
zh_cn: 那么可能就需要修改源码、并重新编译打包后再将应用提交执行。

source: onTimer(timestamp: Long, ctx: OnTimerContext, out: Collector[OUT]) is a callback function that is invoked when a previously registered timer triggers.
zh_cn: onTimer(timestamp: Long, ctx: OnTimerContext, out: Collector[OUT])是一个回调函数，它会在之前注册的计时器触发时被调用。

source: open transactions can block consumers from reading a partition and introduce sig‐ nificant delays.
zh_cn: 因此，开启事务可能会阻碍消费者从分区中读取消息并带来明显延迟。

source: open() is called before any processing methods, such as flatMap() in the case of a FlatMapFunction, are called.
zh_cn: 该方法会在任意处理方法（例如FlatMapFunction中的flatMap()）之前调用。

source: open() is typically used for setup work that needs to be done only once.
zh_cn: open()通常用于那些只需进行一次的设置工作。

source: operators depends on the default environment parallelism, you can simply scale an application by starting it from the same JAR file and specifying a new parallelism.
zh_cn: 如果应用算子并行度是基于环境默认并行度计算而来，则你可以在使用相同JAR文件运行应用的同时指定一个新的并行度，从而实现对应用的扩缩容。

source: or purging a window without emitting a result if a certain condition is fulfilled.
zh_cn: 还能够在某个条件满足时只清除窗口而不发出结果。

source: orderedWait() applies an asynchronous operator that emits results in the order of the input records, while the operator of unorderWait() only ensures
zh_cn: orderedWait()会启用一个按照数据记录顺序发出结果的异步算子，

source: org.apache.flink.metrics.Histogram interface allows you to collect values, get
zh_cn: 你可以通过org.apache.flink.metrics.Histogram接口来收集数值，获取收集值的数量并为到目前为止收集的值生成统计信息（例如最小值、最大值、标准差、均值等）。

source: own types and tell Flink how to handle them efficiently.
zh_cn: 或者你可能需要定义自己的类型并告知Flink该如何高效地处理它们。

source: own window with the element’s timestamp as the start time and the session gap as the
zh_cn: 该窗口的起始时间是元素的时间戳，大小为会话间隔。

source: parameter is the size of the JVM heap memory, which is set with the key taskman ager.heap.size.
zh_cn: 其中所涉及最重要的参数是JVM堆内存大小，它可以通过taskmanager.heap.size配置项设置。

source: perature of a sensor monotonically increases for a period of 1 second in processing time:
zh_cn: 如果某个传感器的温度在1秒的处理时间内持续上升则发出警告：

source: personTuple.setField(43, 1); // set the 2nd field to 43
zh_cn: personTuple.setField(43, 1); // 将第二个字段设为43

source: persons.keyBy("birthday._") // key by all fields of nested tuple
zh_cn: persons.keyBy("birthday._") // 以元组中的全部字段为键值

source: persons.keyBy("birthday._1") // key by field of nested tuple
zh_cn: persons.keyBy("birthday._1") // 以嵌套元组的字段为键值

source: ple asynchronous queries and wait for their results.
zh_cn: 因此，客户端可以同时发出多个异步请求并等待其返回结果。

source: pointed and recovered in the case of a failure.
zh_cn: 该状态会被写入检查点，并在故障时恢复。

source: point—when all tasks have successfully written their state into the remote storage— the JobManager writes the state handles to the remote storage and a pointer to this location to ZooKeeper.
zh_cn: 在检查点即将完成的时候，如果所有任务已经将各自状态成功写入远程存储，JobManager就会将状态句柄写入远程存储，并将远程位置的路径地址写入ZooKeeper。

source: preCommit(txn: TXN): Unit precommits a transaction.
zh_cn: preCommit(txn: TXN): Unit预提交事务。

source: precede a barrier are included in the barrier’s checkpoint and all modifications due to records that follow the barrier are included in a later checkpoint.
zh_cn: 所有先于分隔符的记录所引起的状态更改都会被包含在分隔符所对应的检查点之中；而所有晚于分隔符的记录所引起的状态更改都会被纳入之后的检查点中。

source: present DataStream methods that enable users to control partitioning strategies or
zh_cn: 本节我们会介绍DataStream中用于控制分区策略或自定义分区策略的方法。

source: processElement(v: IN, ctx: Context, out: Collector[OUT]) is called for each record of the stream.
zh_cn: processElement(v: IN, ctx: Context, out: Collector[OUT])会针对流中的每条记录都调用一次。

source: processes can be started with custom Java options—for example, to fine-tune the garbage collector or to enable remote debugging, with the keys env.java.opts, env.java.opts.jobmanager, and env.java.opts.taskmanager.
zh_cn: Flink的JVM进程支持在启动时自定义Java选项。例如，你可以使用env.java.opts、evn.java.opts.jobmanager及env.java.opts.taskmanager来对垃圾收集器进行微调或开启远程调试。

source: processing-time or event-time semantics depends on the value returned by the Win dowAssigner.isEventTime() method.
zh_cn: 该时间是处理时间还是事件时间语义取决于WindowAssigner.isEventTime()方法的返回值。

source: proxy listens on port 9067, but the port can be configured in the ./conf/flink- conf.yaml file:
zh_cn: 客户端代理的默认监听端口是9067，你可以在./conf/flink- conf.yaml文件中对它进行配置：

source: quently received records are written in the context of the transaction.
zh_cn: 所有针对接下来所接收记录的写出操作都会被纳入到这个事务中。

source: ration key, you can specify one or more directories (separated by colons) that are
zh_cn: 利用io.tmp.dirs配置项，你可以指定一个或多个目录（英文冒号分割）用以在本地文件系统上存储数据。

source: reading per window and emits them together with the
zh_cn: 它会将读数连同窗口结束时间戳一起发出。

source: registerEventTimeTimer(timestamp: Long): Unit registers an event-time timer for the current key.
zh_cn: registerEventTimeTimer(timestamp: Long): Unit针对当前键值注册一个事件时间计时器。

source: registerProcessingTimeTimer(timestamp: Long): Unit registers a processing time timer for the current key.
zh_cn: registerProcessingTimeTimer(timestamp: Long): Unit针对当前键值注册一个处理时间计时器。

source: relevant data in the persistent storage and writes a pointer to the information—the storage path—to ZooKeeper.
zh_cn: JobManager会将所有相关数据存储持久化存储并将这些信息的存储路径写入ZooKeeper。

source: replaced by the ReduceFunction’s result.
zh_cn: 随后会用ReduceFunction的结果替换窗口状态。

source: requires a KeyedSerializationSchema in order to extract the message keys and con‐ figure the FlinkKafkaPartitioner parameter with null to disable the default partitioner.
zh_cn: 为此，我们需要提供一个负责从消息中提取键值的KeyedSerializationSchema，并将FlinkKafkaPartitioner的参数设置为null以禁用默认的分区器。

source: return in a different order than the order in which they were sent out) or return the results in the order of the query results to further reduce the latency.
zh_cn: 也可以为了追求更低的延迟按照请求结果的返回顺序处理记录。

source: rich function starts with Rich followed by the transformation name—RichMapFunc tion, RichFlatMapFunction, and so on.
zh_cn: 它们的命名规则是以Rich开头，后面跟着普通转换函数的名字，例如：RichMapFunction、RichFlatMapFunction等。

source: running Flink on a cluster resource manager (YARN, Kubernetes, Mesos) makes it easy to spin up multiple TaskManagers (each with one slot) per compute node.
zh_cn: 因为基于资源管理器（YARN、Kuberanetes、Mesos）运行Flink可以轻松在每个计算节点上启动多个（单处理槽的）TaskManager。

source: scenarios in more detail later in this section.
zh_cn: 我们会在本节后面详细讨论这些场景。

source: semantics (events that have no matching event will not be forwarded).
zh_cn: （无法发出未匹配成功的事件）。

source: setClusterBuilder(ClusterBuilder): The ClusterBuilder builds a Cassandra Cluster that manages the connection to Cassandra.
zh_cn: setClusterBuilder(ClusterBuilder)：ClusterBuilder可以构建一个Cassandra Cluster，用以管理和Cassandra的连接。

source: setHost(String, [Int]): This method is a shortcut for a simple Cluster Builder configured with the hostname and port of a single contact point.
zh_cn: setHost(String, [Int])：是一个针对单个连接点的简单ClusterBuilder配置主机名和端口的快捷方法。

source: setMapperOptions(MapperOptions): This provides options for Cassandra’s Object Mapper, such as configurations for consistency, time-to-live (TTL), and
zh_cn: setMapperOptions(MapperOptions)：该方法用于指定Cassandra Object Mapper的一些选项，例如一致性配置、TTL（time-to-live 生存时间）和空字段处理等。

source: setQuery(String): This specifies the CQL INSERT query to write tuples, case classes, or rows to Cassandra.
zh_cn: setQuery(String)：该方法用于指定向Cassandra插入元组、样例类或Row的CQL INSERT查询。

source: shows all variables that are available to configure metrics scopes.
zh_cn: 表10-18展示了指标域配置中的所有变量。

source: single method that can be easily implemented.
zh_cn: Encoder接口非常简单，它只有一个方法，实现起来很容易。

source: sink sets transaction.timeout.ms to one hour, which means you probably need to adjust the transaction.max.timeout.ms property of your Kafka setup, which is set to 15 minutes by default.
zh_cn: 默认情况下，Flink Kafka数据汇的transaction.timeout.ms为1小时，所以你可能需要调整Kafka中transaction.max.timeout.ms的设置，它的默认时间是15分钟。

source: sink task to a single Kafka partition—all records emitted by the same sink task are written to the same partition and a single partition may contain the records of multi‐ ple sink tasks if there are more tasks than partitions.
zh_cn: 在没有指定的情况下，默认的分区器（partitioner）会将每个数据汇任务映射到一个单独的Kafka分区，即单个任务的所有记录都会被发往同一分区。如果任务数多余分区数，则每个分区可能会包含多个任务发来的记录。
